# 장고
1) 웹페이지는 문서다.
2) 사용자의 정보를 저장하고 싶다
3) 코드냐 소설이냐
- 모델은 database & sql 을,
- 템플릿은 html을 맡아라
- 장고에서 view는 중간에서 얘네들 관리해라
- 한 눈에 잘 들어오게 나눠보자!

# 웹 프레임워크가 보통 하는 일
 1) Model
 2) Controller는 장고에서는 view, 
 3) View 는 장고에서는 Template
-->  이것을 보통 MVC 패턴이라고 부른다.

# 장고가 특별히 하는 일
1) 코드는 짧은 게 좋다
- 짧게 코드를 짤 수 있게 해줌
2) 서비스에는 관리자 페이지가 필요함
- 관리자 페이지를 자동으로 만들어줌

# Css 서식
- 좀 더 예쁘고 세련되게 웹을 꾸며주는 것

# Java script
- 저장하기를 누르면 화면이 번쩍!
- 그냥 html이랑 css를 쓰면 화면이 번쩍 하는데,
- Java script랑 콜라보를 하면 자연스럽게 추가 할 수 있음
- 사용자가 적을 때는 html으로만 써도 상관이 없는데
- 사용자가 많아질 때는 사용자 정보를 보내는 데 서버에 무리가 갈 수 있다.
---> 그래서 가능한 서버에 무리가 가지 않는 선에서 사용자 정보를 보낼 수 있도록!

# 친절한 개발자 씨 (twitter)
- 부트스트랩: CSS, Javascript 내용
- 폰트어썸 font awesome: 예쁜 아이콘
